// Решите загадку: Сколько чисел от 1 до 1000 содержат как минимум одну цифру 3?
// Напишите ответ здесь:
#include <iostream>
using namespace std;
int main()
{
    int n = 0;
    for (int i = 1; i <= 1000; i++)
        if (i > 99 && i < 1000)
        {
            int a = i / 100;       
            int b = (i / 10) % 10; 
            int c = i % 10;        
            if (a == b && b == c)
                n++;
        }
    cout << "Итого = " << n;
    return 0;
}
// Закомитьте изменения и отправьте их в свой репозиторий.